
# State **`s3://infrahouse-aws-control/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       4 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                           |
|:--------:|:----------------------------------------------------|
|    🟢     | `aws_iam_access_key.twindb_test_runner`             |
|    🟢     | `aws_iam_policy.TwinDBTestRunner`                   |
|    🟢     | `aws_iam_user.twindb_test_runner`                   |
|    🟢     | `aws_iam_user_policy_attachment.twindb_test_runner` |
|    🟢     | `%0ATerraform`                                      |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/0ad1f1c4-0364-47ea-a925-8710b91241ac/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_access_key.twindb_test_runner will be created
  + resource "aws_iam_access_key" "twindb_test_runner" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "twindb_test_runner"
    }

  # aws_iam_policy.TwinDBTestRunner will be created
  + resource "aws_iam_policy" "TwinDBTestRunner" {
      + arn         = (known after apply)
      + description = "Policy for TwinDB Backup integration tests"
      + id          = (known after apply)
      + name        = "TwinDBTestRunner"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::twindb-backup-test-*",
                        ]
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::twindb-backup-test-*"
                    },
                  + {
                      + Action   = [
                          + "s3:CreateBucket",
                          + "s3:DeleteBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::twindb-backup-test-*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "created_by" = "infrahouse/infrahouse-aws-control"
        }
      + tags_all    = {
          + "created_by" = "infrahouse/infrahouse-aws-control"
        }
    }

  # aws_iam_user.twindb_test_runner will be created
  + resource "aws_iam_user" "twindb_test_runner" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "twindb_test_runner"
      + path          = "/"
      + tags          = {
          + "created_by" = "infrahouse/infrahouse-aws-control"
        }
      + tags_all      = {
          + "created_by" = "infrahouse/infrahouse-aws-control"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.twindb_test_runner will be created
  + resource "aws_iam_user_policy_attachment" "twindb_test_runner" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "twindb_test_runner"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_access_key.twindb_test_runner will be created%0A  + resource "aws_iam_access_key" "twindb_test_runner" {%0A      + create_date                    = (known after apply)%0A      + encrypted_secret               = (known after apply)%0A      + encrypted_ses_smtp_password_v4 = (known after apply)%0A      + id                             = (known after apply)%0A      + key_fingerprint                = (known after apply)%0A      + secret                         = (sensitive value)%0A      + ses_smtp_password_v4           = (sensitive value)%0A      + status                         = "Active"%0A      + user                           = "twindb_test_runner"%0A    }%0A%0A  # aws_iam_policy.TwinDBTestRunner will be created%0A  + resource "aws_iam_policy" "TwinDBTestRunner" {%0A      + arn         = (known after apply)%0A      + description = "Policy for TwinDB Backup integration tests"%0A      + id          = (known after apply)%0A      + name        = "TwinDBTestRunner"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutObject",%0A                          + "s3:GetObject",%0A                          + "s3:DeleteObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::twindb-backup-test-*",%0A                        ]%0A                    },%0A                  + {%0A                      + Action   = "s3:ListBucket"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::twindb-backup-test-*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3:CreateBucket",%0A                          + "s3:DeleteBucket",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::twindb-backup-test-*",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags        = {%0A          + "created_by" = "infrahouse/infrahouse-aws-control"%0A        }%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/infrahouse-aws-control"%0A        }%0A    }%0A%0A  # aws_iam_user.twindb_test_runner will be created%0A  + resource "aws_iam_user" "twindb_test_runner" {%0A      + arn           = (known after apply)%0A      + force_destroy = false%0A      + id            = (known after apply)%0A      + name          = "twindb_test_runner"%0A      + path          = "/"%0A      + tags          = {%0A          + "created_by" = "infrahouse/infrahouse-aws-control"%0A        }%0A      + tags_all      = {%0A          + "created_by" = "infrahouse/infrahouse-aws-control"%0A        }%0A      + unique_id     = (known after apply)%0A    }%0A%0A  # aws_iam_user_policy_attachment.twindb_test_runner will be created%0A  + resource "aws_iam_user_policy_attachment" "twindb_test_runner" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + user       = "twindb_test_runner"%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAic3Rkb3V0IjogIltjb21tYW5kXS9ob21lL3J1bm5lci93b3JrL190ZW1wLzBhZDFmMWM0LTAzNjQtNDdlYS1hOTI1LTg3MTBiOTEyNDFhYy90ZXJyYWZvcm0tYmluIHBsYW4gLXZhci1maWxlPWNvbmZpZ3VyYXRpb24udGZ2YXJzIC0tb3V0PXRmLnBsYW5cblxuVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGVcdTAwMWJbMG1cblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cblx1MDAxYlsxbSAgIyBhd3NfaWFtX2FjY2Vzc19rZXkudHdpbmRiX3Rlc3RfcnVubmVyXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFxuXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImF3c19pYW1fYWNjZXNzX2tleVwiIFwidHdpbmRiX3Rlc3RfcnVubmVyXCIge1xuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlX2RhdGUgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gZW5jcnlwdGVkX3NlY3JldCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gZW5jcnlwdGVkX3Nlc19zbXRwX3Bhc3N3b3JkX3Y0ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0ga2V5X2ZpbmdlcnByaW50ICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc2VjcmV0ICAgICAgICAgICAgICAgICAgICAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHNlc19zbXRwX3Bhc3N3b3JkX3Y0ICAgICAgICAgICA9IChzZW5zaXRpdmUgdmFsdWUpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzdGF0dXMgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIkFjdGl2ZVwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1c2VyICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInR3aW5kYl90ZXN0X3J1bm5lclwiXG4gICAgfVxuXG5cdTAwMWJbMW0gICMgYXdzX2lhbV9wb2xpY3kuVHdpbkRCVGVzdFJ1bm5lclx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwiVHdpbkRCVGVzdFJ1bm5lclwiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gZGVzY3JpcHRpb24gPSBcIlBvbGljeSBmb3IgVHdpbkRCIEJhY2t1cCBpbnRlZ3JhdGlvbiB0ZXN0c1wiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIG5hbWUgICAgICAgID0gXCJUd2luREJUZXN0UnVubmVyXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0ge1xuICAgICAgICAgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcInMzOlB1dE9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcInMzOkdldE9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcInMzOkRlbGV0ZU9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gUmVzb3VyY2UgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiYXJuOmF3czpzMzo6OnR3aW5kYi1iYWNrdXAtdGVzdC0qXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB7XG4gICAgICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIlxuICAgICAgICAgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gUmVzb3VyY2UgPSBcImFybjphd3M6czM6Ojp0d2luZGItYmFja3VwLXRlc3QtKlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB7XG4gICAgICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gQWN0aW9uICAgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiczM6Q3JlYXRlQnVja2V0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiczM6RGVsZXRlQnVja2V0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBSZXNvdXJjZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJhcm46YXdzOnMzOjo6dHdpbmRiLWJhY2t1cC10ZXN0LSpcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdGFncyAgICAgICAgPSB7XG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXG4gICAgICAgIH1cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2UtYXdzLWNvbnRyb2xcIlxuICAgICAgICB9XG4gICAgfVxuXG5cdTAwMWJbMW0gICMgYXdzX2lhbV91c2VyLnR3aW5kYl90ZXN0X3J1bm5lclx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWRcblx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJhd3NfaWFtX3VzZXJcIiBcInR3aW5kYl90ZXN0X3J1bm5lclwiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFybiAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBmb3JjZV9kZXN0cm95ID0gZmFsc2VcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBuYW1lICAgICAgICAgID0gXCJ0d2luZGJfdGVzdF9ydW5uZXJcIlxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcGF0aCAgICAgICAgICA9IFwiL1wiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB0YWdzICAgICAgICAgID0ge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2UtYXdzLWNvbnRyb2xcIlxuICAgICAgICB9XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB0YWdzX2FsbCAgICAgID0ge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2UtYXdzLWNvbnRyb2xcIlxuICAgICAgICB9XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB1bmlxdWVfaWQgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuXHUwMDFiWzFtICAjIGF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC50d2luZGJfdGVzdF9ydW5uZXJcdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50XCIgXCJ0d2luZGJfdGVzdF9ydW5uZXJcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHVzZXIgICAgICAgPSBcInR3aW5kYl90ZXN0X3J1bm5lclwiXG4gICAgfVxuXG5cdTAwMWJbMW1QbGFuOlx1MDAxYlswbSA0IHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS5cblx1MDAxYlswbVx1MDAxYls5MG1cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MDAxYlswbVxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6ICUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGVcdTAwMWJbMG0lMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEFcdTAwMWJbMW0gICMgYXdzX2lhbV9hY2Nlc3Nfa2V5LnR3aW5kYl90ZXN0X3J1bm5lclx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX2lhbV9hY2Nlc3Nfa2V5XCIgXCJ0d2luZGJfdGVzdF9ydW5uZXJcIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gY3JlYXRlX2RhdGUgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGVuY3J5cHRlZF9zZWNyZXQgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBlbmNyeXB0ZWRfc2VzX3NtdHBfcGFzc3dvcmRfdjQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGtleV9maW5nZXJwcmludCAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzZWNyZXQgICAgICAgICAgICAgICAgICAgICAgICAgPSAoc2Vuc2l0aXZlIHZhbHVlKSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHNlc19zbXRwX3Bhc3N3b3JkX3Y0ICAgICAgICAgICA9IChzZW5zaXRpdmUgdmFsdWUpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gc3RhdHVzICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJBY3RpdmVcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHVzZXIgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidHdpbmRiX3Rlc3RfcnVubmVyXCIlMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBhd3NfaWFtX3BvbGljeS5Ud2luREJUZXN0UnVubmVyXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZCUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwiVHdpbkRCVGVzdFJ1bm5lclwiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBkZXNjcmlwdGlvbiA9IFwiUG9saWN5IGZvciBUd2luREIgQmFja3VwIGludGVncmF0aW9uIHRlc3RzXCIlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBuYW1lICAgICAgICA9IFwiVHdpbkRCVGVzdFJ1bm5lclwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcGF0aCAgICAgICAgPSBcIi9cIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0geyUwQSAgICAgICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiczM6UHV0T2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcInMzOkdldE9iamVjdFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJzMzpEZWxldGVPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFJlc291cmNlID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJhcm46YXdzOnMzOjo6dHdpbmRiLWJhY2t1cC10ZXN0LSpcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHslMEEgICAgICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIiUwQSAgICAgICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OnR3aW5kYi1iYWNrdXAtdGVzdC0qXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0geyUwQSAgICAgICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiczM6Q3JlYXRlQnVja2V0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcInMzOkRlbGV0ZUJ1Y2tldFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gUmVzb3VyY2UgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcImFybjphd3M6czM6Ojp0d2luZGItYmFja3VwLXRlc3QtKlwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHRhZ3MgICAgICAgID0geyUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLWF3cy1jb250cm9sXCIlMEEgICAgICAgIH0lMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB0YWdzX2FsbCAgICA9IHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvaW5mcmFob3VzZS1hd3MtY29udHJvbFwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEFcdTAwMWJbMW0gICMgYXdzX2lhbV91c2VyLnR3aW5kYl90ZXN0X3J1bm5lclx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX2lhbV91c2VyXCIgXCJ0d2luZGJfdGVzdF9ydW5uZXJcIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYXJuICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBmb3JjZV9kZXN0cm95ID0gZmFsc2UlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIG5hbWUgICAgICAgICAgPSBcInR3aW5kYl90ZXN0X3J1bm5lclwiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcGF0aCAgICAgICAgICA9IFwiL1wiJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdGFncyAgICAgICAgICA9IHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvaW5mcmFob3VzZS1hd3MtY29udHJvbFwiJTBBICAgICAgICB9JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdGFnc19hbGwgICAgICA9IHslMEEgICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvaW5mcmFob3VzZS1hd3MtY29udHJvbFwiJTBBICAgICAgICB9JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdW5pcXVlX2lkICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBhd3NfaWFtX3VzZXJfcG9saWN5X2F0dGFjaG1lbnQudHdpbmRiX3Rlc3RfcnVubmVyXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZCUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJhd3NfaWFtX3VzZXJfcG9saWN5X2F0dGFjaG1lbnRcIiBcInR3aW5kYl90ZXN0X3J1bm5lclwiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdXNlciAgICAgICA9IFwidHdpbmRiX3Rlc3RfcnVubmVyXCIlMEEgICAgfSUwQSUwQVx1MDAxYlsxbVBsYW46XHUwMDFiWzBtIDQgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQVx1MDAxYlswbVx1MDAxYls5MG0lMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTAwMWJbMG0lMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogNCwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19```
</p></details>